test-results/output-openj9-11-tuned/ab_output.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /greetings
Document Length:        26 bytes

Concurrency Level:      5
Time taken for tests:   1.476 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      725000 bytes
HTML transferred:       130000 bytes
Requests per second:    3387.33 [#/sec] (mean)
Time per request:       1.476 [ms] (mean)
Time per request:       0.295 [ms] (mean, across all concurrent requests)
Transfer rate:          479.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0      37
Processing:     0    1   1.3      1      38
Waiting:        0    1   1.1      1      37
Total:          1    1   1.5      1      39

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      3
  99%      6
 100%     39 (longest request)